tutorials/oscillatingCylinder/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-13;
        relTol          0;
    }
    pFinal { $p; }
    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-13;
        relTol          0;
    }
    UFinal { $U; }
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    3;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    consistent          yes;
    ddtCorr             no;
    pRefCell            0;
    pRefValue           0;
}
